gl-sergei/u2f-token/mcu/usb-efm32.c
          /* Remote Wakeup enabled */
          if ((feature & (1 << 5)))
            status_info |= 2;
          else
            status_info &= ~2;

          /* Bus-powered */
          if ((feature & (1 << 6)))
            status_info |= 1;
          else /* Self-powered */
            status_info &= ~1;

          return usb_lld_ctrl_send (dev, &status_info, 2);
        }
    }
  else if (rcp == INTERFACE_RECIPIENT)
    {
      if (dev->configuration == 0)
        return -1;

      return USB_EVENT_GET_STATUS_INTERFACE;
    }
  else if (rcp == ENDPOINT_RECIPIENT)
    {
      uint8_t n = (arg->index & 0x0f);

      if ((arg->index & 0x70) || n == ENDP0)
        return -1;


      if (arg->index & 0x80)
        {
          /* IN endpoint */

          if (efm32hg_ep_in_is_disabled (n))
            return -1;

          status_info = efm32hg_ep_in_is_stall (n);
        }
      else
        {
          /* OUT endpoint */

          if (efm32hg_ep_out_is_disabled (n))
            return -1;

          status_info = efm32hg_ep_out_is_stall (n);
        }

      return usb_lld_ctrl_send (dev, &status_info, 2);
    }

  return -1;
}

static int
std_clear_feature (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    {
      if (arg->len != 0 || arg->index != 0)
        return -1;

      if (arg->value == FEATURE_DEVICE_REMOTE_WAKEUP)
        {
          dev->feature &= ~(1 << 5);
          return USB_EVENT_CLEAR_FEATURE_DEVICE;
        }
    }
  else if (rcp == ENDPOINT_RECIPIENT)
    {
      uint8_t n = (arg->index & 0x0f);

      if (dev->configuration == 0)
        return -1;

      if (arg->len != 0 || (arg->index >> 8) != 0
          || arg->value != FEATURE_ENDPOINT_HALT || n == ENDP0)
        return -1;


      if (arg->index & 0x80)
        {
          /* IN endpoint */

          if (efm32hg_ep_in_is_disabled (n))
            return -1;

          efm32hg_ep_in_unstall (n);
        }
      else
        {
          /* OUT endpoint */

          if (efm32hg_ep_out_is_disabled (n))
            return -1;

          efm32hg_ep_out_unstall (n);
        }

      return USB_EVENT_CLEAR_FEATURE_ENDPOINT;
    }

  return -1;
}

static int
std_set_feature (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    {
      if (arg->len != 0 || arg->index != 0)
        return -1;

      if (arg->value == FEATURE_DEVICE_REMOTE_WAKEUP)
        {
          dev->feature |= 1 << 5;
          return USB_EVENT_SET_FEATURE_DEVICE;
        }
    }
  else if (rcp == ENDPOINT_RECIPIENT)
    {
      uint8_t n = (arg->index & 0x0f);

      if (dev->configuration == 0)
        return -1;

      if (arg->len != 0 || (arg->index >> 8) != 0
          || arg->value != FEATURE_ENDPOINT_HALT || n == ENDP0)
        return -1;

      if (arg->index & 0x80)
        {
          /* IN endpoint */

          if (efm32hg_ep_in_is_disabled (n))
            return -1;

          efm32hg_ep_in_stall (n);
        }
      else
        {
          /* OUT endpoint */

          if (efm32hg_ep_out_is_disabled (n))
            return -1;

          efm32hg_ep_out_stall (n);
        }

      return USB_EVENT_SET_FEATURE_ENDPOINT;
    }

  return -1;
}

static int
std_set_address (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT && arg->len == 0 && arg->value <= 127
      && arg->index == 0 && dev->configuration == 0)
    {
      efm32hg_set_daddr (arg->value);
      efm32hg_prepare_ep0_setup (dev);
      dev->state = WAIT_STATUS_IN;
      efm32hg_prepare_ep0_in (NULL, 0, 0);
      return USB_EVENT_DEVICE_ADDRESSED;
    }

  return -1;
}

static int
std_get_descriptor (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  if (USB_SETUP_SET (arg->type))
    return -1;

  return USB_EVENT_GET_DESCRIPTOR;
}

static int
std_get_configuration (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_SET (arg->type))
    return -1;

  if (arg->value != 0 || arg->index != 0 || arg->len != 1)
    return -1;

  if (rcp == DEVICE_RECIPIENT)
    return usb_lld_ctrl_send (dev, &dev->configuration, 1);

  return -1;
}

static int
std_set_configuration (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type))
    return -1;

  if (rcp == DEVICE_RECIPIENT && arg->index == 0 && arg->len == 0)
    return USB_EVENT_SET_CONFIGURATION;

  return -1;
}

static int
std_get_interface (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_SET (arg->type))
    return -1;

  if (arg->value != 0 || (arg->index >> 8) != 0 || arg->len != 1)
    return -1;

  if (dev->configuration == 0)
    return -1;

  if (rcp == INTERFACE_RECIPIENT)
    return USB_EVENT_GET_INTERFACE;

  return -1;
}

static int
std_set_interface (struct usb_dev *dev)
{
  struct device_req *arg = &dev->dev_req;
  uint8_t rcp = arg->type & RECIPIENT;

  if (USB_SETUP_GET (arg->type) || rcp != INTERFACE_RECIPIENT
      || arg->len != 0 || (arg->index >> 8) != 0
      || (arg->value >> 8) != 0 || dev->configuration == 0)
    return -1;

  return USB_EVENT_SET_INTERFACE;
}

static int
handle_setup0 (struct usb_dev *dev)
{
  struct ctrl_data *data_p = &dev->ctrl_data;
  int r = -1;
  HANDLER handler;

  data_p->addr = NULL;
  data_p->len = 0;
  data_p->require_zlp = 0;

  if ((dev->dev_req.type & REQUEST_TYPE) == STANDARD_REQUEST)
    {
      switch (dev->dev_req.request)
        {
        case 0: handler = std_get_status;  break;
        case 1: handler = std_clear_feature;  break;
        case 3: handler = std_set_feature;  break;
        case 5: handler = std_set_address;  break;
        case 6: handler = std_get_descriptor;  break;
        case 8: handler = std_get_configuration;  break;
        case 9: handler = std_set_configuration;  break;
        case 10: handler = std_get_interface;  break;
        case 11: handler = std_set_interface;  break;
        default: handler = std_none;  break;
        }

      if ((r = (*handler) (dev)) < 0)
        {
          usb_lld_ctrl_error (dev);
          return USB_EVENT_OK;
        }
      else
        return r;
    }
  else
    return USB_EVENT_CTRL_REQUEST;
}

static int
handle_in0 (struct usb_dev *dev)
{
  if (dev->state == IN_DATA || dev->state == LAST_IN_DATA)
    handle_datastage_in (dev);
  else if (dev->state == WAIT_STATUS_IN)
    { /* Control WRITE transfer done successfully.  */
      efm32hg_prepare_ep0_setup (dev);
      dev->state = WAIT_SETUP;
      return USB_EVENT_CTRL_WRITE_FINISH;
    }
  else
    {
      dev->state = STALLED;
      efm32hg_ep_out_stall (ENDP0);
      efm32hg_ep_in_stall (ENDP0);
      dev->state = WAIT_SETUP;
      efm32hg_prepare_ep0_setup (dev);
    }

